In [5]:
import numpy as np
import pandas as pd

In [6]:
Labels = ['a','b','c']
my_list = [10,20,30]

In [7]:
pd.Series( my_list)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(data = my_list,index = Labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(my_list,Labels)

a    10
b    20
c    30
dtype: int64

In [10]:
arr = np.array([10,20,30])

In [11]:
arr

array([10, 20, 30])

In [12]:
pd.Series(arr,Labels)

a    10
b    20
c    30
dtype: int32

In [13]:
d = {'a': 10,'b':20,'c':30}

In [14]:
d

{'a': 10, 'b': 20, 'c': 30}

In [15]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

DATA IN SERIES
a pandas series can hold a vaiety 
of objects types:

In [16]:
pd.Series(data = Labels)

0    a
1    b
2    c
dtype: object

In [17]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [18]:
ser1 = pd.Series([1,2,3,4],index =['usa','ussr','japan','germany'])

In [19]:
ser1

usa        1
ussr       2
japan      3
germany    4
dtype: int64

In [20]:
ser1['germany']

4

In [21]:
ser1

usa        1
ussr       2
japan      3
germany    4
dtype: int64

In [22]:
ser2 = pd.Series([1,2,3,4],index = ['india','italy','canada','uk'])

In [23]:
ser2['italy']

2

In [24]:
ser1 + ser2

canada    NaN
germany   NaN
india     NaN
italy     NaN
japan     NaN
uk        NaN
usa       NaN
ussr      NaN
dtype: float64

In [25]:
ser1 - ser2

canada    NaN
germany   NaN
india     NaN
italy     NaN
japan     NaN
uk        NaN
usa       NaN
ussr      NaN
dtype: float64

In [26]:
ser1 * ser2

canada    NaN
germany   NaN
india     NaN
italy     NaN
japan     NaN
uk        NaN
usa       NaN
ussr      NaN
dtype: float64

In [27]:
ser3 = pd.Series(['a','b','c','d'] , [1,2,3,4])

In [28]:
ser3

1    a
2    b
3    c
4    d
dtype: object

In [29]:
ser4 = pd.Series(['e','f','g','h'],[1,2,3,4])

In [30]:
ser3+ser4

1    ae
2    bf
3    cg
4    dh
dtype: object

DATA FRAMES

bunch of series and objects together

In [31]:
from numpy.random import randn
np.random.seed(101)

In [32]:
df = pd.DataFrame(randn(5,4), index = 'A B C D E' .split(), columns = 'W X Y Z'.split()) #this is getting data from random seed

In [33]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [36]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

DataFrames column are just frames

In [37]:
type(df['W'])

pandas.core.series.Series

In [38]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df['new'] = df['W'] + df['Y']

In [40]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

removing column

In [41]:
df.drop('new', axis = 1)  # axis = 1 is for columns,for rows axis = 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [43]:
 df.drop('new',axis =1,inplace = True)

In [44]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

removing rows

In [45]:
df.drop('E',axis =0 ,inplace = True)

In [46]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

selection rows

In [47]:
df.loc['A']     #to get row by name

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [48]:
df.iloc[2]     #to get row by index

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [49]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
Name: W, dtype: float64

In [50]:
df.loc['B','Y']

-0.8480769834036315

In [51]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

CONDITIONAL SELECTION

In [52]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [53]:
df[df>0]    #return the particular value where bool df is true

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [58]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [59]:
df[df['W'] >0 ]  [['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

In [60]:
df[df['W'] > 0] [['Y', 'X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

In [62]:
df[(df['W']>0) & (df['Y']>0.5)]  #here condition are checked and their is checked

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [63]:
df[(df['W'] >0.3) | (df['Y'] >0.5)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

MORE INDEX DETAILS

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [65]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

In [66]:
newind = 'CA NY WY OR'.split() #splits the string and assign them in order

In [67]:
df['States'] = newind

In [68]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR

In [69]:
df.set_index('States') #states column is the new index ,the original df does not change

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057

In [70]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR

In [71]:
df.set_index('States',inplace = True)

In [72]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057

MULTI INDEX AND INDEX HIERARCHY

In [77]:
#Index Levels
outside = ['g1','g1','g1','g2','g2','g2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [78]:
hier_index    #for creating groups inside the df

MultiIndex([('g1', 1),
            ('g1', 2),
            ('g1', 3),
            ('g2', 1),
            ('g2', 2),
            ('g2', 3)],
           )

In [81]:
df = pd.DataFrame(np.random.rand(6,2),index = hier_index,columns =['A','B'])

In [82]:
df

             A         B
g1 1  0.043397  0.223937
   2  0.575205  0.120434
   3  0.500117  0.138010
g2 1  0.052808  0.178277
   2  0.442368  0.877587
   3  0.949264  0.478167

In [83]:
df.loc['g1']

          A         B
1  0.043397  0.223937
2  0.575205  0.120434
3  0.500117  0.138010

In [84]:
df.loc['g1'].loc[1]

A    0.043397
B    0.223937
Name: 1, dtype: float64

In [85]:
df.index.names

FrozenList([None, None])

In [88]:
df.index.names = ['group','num']
df

                  A         B
group num
g1    1    0.043397  0.223937
      2    0.575205  0.120434
      3    0.500117  0.138010
g2    1    0.052808  0.178277
      2    0.442368  0.877587
      3    0.949264  0.478167

In [87]:
df

                  A         B
group num
g1    1    0.043397  0.223937
      2    0.575205  0.120434
      3    0.500117  0.138010
g2    1    0.052808  0.178277
      2    0.442368  0.877587
      3    0.949264  0.478167

In [89]:
df.xs('g1')   #return the required part

            A         B
num
1    0.043397  0.223937
2    0.575205  0.120434
3    0.500117  0.138010

In [90]:
df.xs(('g1',1))

A    0.043397
B    0.223937
Name: (g1, 1), dtype: float64

In [91]:
df.xs(1,level = 'num')

              A         B
group
g1     0.043397  0.223937
g2     0.052808  0.178277

MISSING DATA

In [92]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})

In [93]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [94]:
df.dropna()   #directly removing all the na values ,for rows as axis = 0 by default

     A    B  C
0  1.0  5.0  1

In [96]:
df   #does not change the original df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [97]:
df.dropna(axis = 1) #removes the na valves in column

   C
0  1
1  2
2  3

In [103]:
df.dropna(thresh =3)  #threshold will remove the row only if there are at leastb2 na value

     A    B  C
0  1.0  5.0  1

In [104]:
df.fillna(value = 'FILL VALUE') #we can fill values together

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [105]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [106]:
df['A'].fillna(value = df['A'].mean())  #filling the value by the mean value in the column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

GROUP BY
the groupby method allow you to group rows of data together and call aggregate function

In [114]:
data = {'Company':['GOOG','GOOG','MSFT','MSTF','FB','FB'],
       'Person':['sam','charlie','amy','akanksha','sarah','carl'],
       'Sales':[200,120,340,124,124,243]}

In [115]:
df = pd.DataFrame(data)

In [116]:
df

  Company    Person  Sales
0    GOOG       sam    200
1    GOOG   charlie    120
2    MSFT       amy    340
3    MSTF  akanksha    124
4      FB     sarah    124
5      FB      carl    243

In [117]:
df.groupby(['Company'])

In [118]:
by_comp = df.groupby('Company')

And then call aggregate method off the object:

In [120]:
by_comp.min()  #arrange in ascending order the company column

           Person  Sales
Company
FB           carl    124
GOOG      charlie    120
MSFT          amy    340
MSTF     akanksha    124

In [121]:
by_comp.max()

           Person  Sales
Company
FB          sarah    243
GOOG          sam    200
MSFT          amy    340
MSTF     akanksha    124

In [122]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          1      1
MSTF          1      1

In [123]:
by_comp.describe()

        Sales
        count   mean        std    min     25%    50%     75%    max
Company
FB        2.0  183.5  84.145707  124.0  153.75  183.5  213.25  243.0
GOOG      2.0  160.0  56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      1.0  340.0        NaN  340.0  340.00  340.0  340.00  340.0
MSTF      1.0  124.0        NaN  124.0  124.00  124.0  124.00  124.0

In [124]:
by_comp.describe().transpose()

Company              FB        GOOG   MSFT   MSTF
Sales count    2.000000    2.000000    1.0    1.0
      mean   183.500000  160.000000  340.0  124.0
      std     84.145707   56.568542    NaN    NaN
      min    124.000000  120.000000  340.0  124.0
      25%    153.750000  140.000000  340.0  124.0
      50%    183.500000  160.000000  340.0  124.0
      75%    213.250000  180.000000  340.0  124.0
      max    243.000000  200.000000  340.0  124.0

In [125]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [126]:
Table = {'Flavor':['Mint Choco Chip','Chocolate','Cookie Dough','Pistachio','Cake Batter','Neapolitian','Fudge brownie','Rocie Road','Latte'],
       'Base Flavor':['Vanilla', 'Chocolate', 'Vanilla', 'Vanilla', 'Vanilla' , 'Vanilla' , 'Chocolate', 'Vanilla', 'Vanilla'],
       'Liked':['yes', 'yes', 'no', 'no', 'no', 'yes', 'yes','no','no'],
        'Flovor Rating': [10,8,9,7,10,4,7,8,9],
        'Texture Rating':[8,7,5,6,7,3,6,5,7],
        'Total Rating': [18.0, 16.6, 9.7,13.4,15.2,5.7,12.5,8.8,15.3]}

In [127]:
Table

{'Flavor': ['Mint Choco Chip',
  'Chocolate',
  'Cookie Dough',
  'Pistachio',
  'Cake Batter',
  'Neapolitian',
  'Fudge brownie',
  'Rocie Road',
  'Latte'],
 'Base Flavor': ['Vanilla',
  'Chocolate',
  'Vanilla',
  'Vanilla',
  'Vanilla',
  'Vanilla',
  'Chocolate',
  'Vanilla',
  'Vanilla'],
 'Liked': ['yes', 'yes', 'no', 'no', 'no', 'yes', 'yes', 'no', 'no'],
 'Flovor Rating': [10, 8, 9, 7, 10, 4, 7, 8, 9],
 'Texture Rating': [8, 7, 5, 6, 7, 3, 6, 5, 7],
 'Total Rating': [18.0, 16.6, 9.7, 13.4, 15.2, 5.7, 12.5, 8.8, 15.3]}

In [128]:
df = pd.DataFrame(Table)

In [129]:
df

,Flavor,Base Flavor,Liked,Flovor Rating,Texture Rating,Total Rating
0,Mint Choco Chip,Vanilla,yes,10,8,18.0
1,Chocolate,Chocolate,yes,8,7,16.6
2,Cookie Dough,Vanilla,no,9,5,9.7
3,Pistachio,Vanilla,no,7,6,13.4
4,Cake Batter,Vanilla,no,10,7,15.2
5,Neapolitian,Vanilla,yes,4,3,5.7
6,Fudge brownie,Chocolate,yes,7,6,12.5
7,Rocie Road,Vanilla,no,8,5,8.8
8,Latte,Vanilla,no,9,7,15.3

In [130]:
group = df.groupby('Base Flavor')

In [131]:
group

In [133]:
group.max()

                    Flavor Liked  Flovor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate    Fudge brownie   yes              8               7          16.6
Vanilla         Rocie Road   yes             10               8          18.0

In [134]:
group.min()

                  Flavor Liked  Flovor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate      Chocolate   yes              7               6          12.5
Vanilla      Cake Batter    no              4               3           5.7

In [135]:
group.min()

                  Flavor Liked  Flovor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate      Chocolate   yes              7               6          12.5
Vanilla      Cake Batter    no              4               3           5.7

In [136]:
group.count()

             Flavor  Liked  Flovor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate         2      2              2               2             2
Vanilla           7      7              7               7             7

In [137]:
group.describe()

            Flovor Rating                                                  \
                    count      mean       std  min   25%  50%   75%   max
Base Flavor
Chocolate             2.0  7.500000  0.707107  7.0  7.25  7.5  7.75   8.0
Vanilla               7.0  8.142857  2.115701  4.0  7.50  9.0  9.50  10.0

            Texture Rating            ...            Total Rating         \
                     count      mean  ...   75%  max        count   mean
Base Flavor                           ...
Chocolate              2.0  6.500000  ...  6.75  7.0          2.0  14.55
Vanilla                7.0  5.857143  ...  7.00  8.0          7.0  12.30


                  std   min     25%    50%     75%   max
Base Flavor
Chocolate    2.899138  12.5  13.525  14.55  15.575  16.6
Vanilla      4.352777   5.7   9.250  13.40  15.250  18.0

[2 rows x 24 columns]

MERGING,JOINING AND CONCATENATION

In [140]:
df1 = pd.DataFrame({'A':['A1','A2','A3','A4'],
                    'B' :['B0','B1','B2','B3']
                    ,'C':['C1','C2','C3','C4']
                    ,'D':['D0','D1','D2','D3']},index = [0,1,2,3])

In [141]:
df1

    A   B   C   D
0  A1  B0  C1  D0
1  A2  B1  C2  D1
2  A3  B2  C3  D2
3  A4  B3  C4  D3

In [143]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [144]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [145]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [146]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

CONCATENATION

In [147]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A1   B0   C1   D0
1    A2   B1   C2   D1
2    A3   B2   C3   D2
3    A4   B3   C4   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [148]:
pd.concat([df1,df2,df3],axis = 1) #for concatenation along rows

      A    B    C    D    A    B    C    D    A    B    C    D
0    A1   B0   C1   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A2   B1   C2   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A3   B2   C3   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A4   B3   C4   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [150]:
left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A': ['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [151]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [152]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

MERGING

In [154]:
pd.merge(left,right,how ='inner',on = 'key') #tis is for merging

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [155]:
pd.merge(left,right,how = 'outer',on = 'key')   #there inner and outerare same since the keys are all the same

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [156]:
left2 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [157]:
 left2

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [158]:
right2

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [159]:
pd.merge(left2,right2,on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [160]:
pd.merge(left2,right2, how ='outer',on = ['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [161]:
pd.merge(left2, right2, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [162]:
pd.merge(left2, right2, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

JOINING

In [163]:
left3 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right3 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [165]:
left3

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [166]:
right3

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [167]:
left3.join(right3)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [168]:
left3.join(right3,how ='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [170]:
left3.join(right3,how ='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

OPERATIONS

In [172]:
df = pd.DataFrame({'coll':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [173]:
df.head()  #used to check the initial section of the data

   coll  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [174]:
df.head(3)

   coll  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi

INFO ON UNIQUE VALUES

In [176]:
df['col2'].unique()  #gives the unique values

array([444, 555, 666], dtype=int64)

In [178]:
df['col2'].nunique()  #gives the no of unique values

3

In [179]:
df['col2'].value_counts()   #gives out the frequency of values

col2
444    2
555    1
666    1
Name: count, dtype: int64

SELECTING DATA

In [183]:
newdf = df[(df['coll']>2) & (df['col2']==444)]

In [184]:
newdf

   coll  col2 col3
3     4   444  xyz

APPLYING FUNCTION

In [186]:
def times2(x):
    return x*2

In [187]:
df['coll'].apply(times2)

0    2
1    4
2    6
3    8
Name: coll, dtype: int64

In [188]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [189]:
df['coll'].sum()

10

In [190]:
del df['coll'] #deleting the column

In [191]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

GET COLUMN AND INDEX NAMES

In [192]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [193]:
df.index

RangeIndex(start=0, stop=4, step=1)

sorting and ordering the dataframes

In [194]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [195]:
df.sort_values(by='col2') #inplace = false by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

find null values or check for null values

In [196]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [197]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [199]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [200]:
df.pivot_table(values = 'D',index =['A','B'],columns =['C'] )

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [201]:
Labels = ['a','b','c']
my_list = [10,20,30]

In [202]:
pd.Series(data = my_list, index = Labels )

a    10
b    20
c    30
dtype: int64

In [203]:
arr = np.array([1,2,3])
pd.Series(arr)

0    1
1    2
2    3
dtype: int32

In [204]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [207]:
ser1 = pd.Series([1,2,3,4],index = ['U' ,'G' ,'F' ,'L'])

In [208]:
ser1['G']

2

In [209]:
from numpy.random import randn
np.random.seed(101)

In [212]:
df = pd.DataFrame(randn(8,8),index ='a b c d e f g h'.split(),columns = 'w x y z w x y z'.split())

In [213]:
df

,w,x,y,z,w,x,y,z
a,0.197524,2.302987,0.729024,-0.863091,0.305632,0.243178,0.864165,-1.560931
b,-0.251897,-0.578120,0.236996,0.200780,0.327845,0.674485,-0.174057,0.780140
c,-0.383258,-0.409318,0.343539,0.196275,-0.982776,2.231555,-0.971393,-1.522333
d,1.133703,0.528187,0.393461,-0.630507,-1.398290,-0.219311,-0.045676,0.012421
e,0.093628,1.240813,-1.097693,-1.908009,-0.380104,-1.666059,-2.736995,1.522562
f,0.178009,-0.626805,-0.391089,1.743477,1.130018,0.897796,0.330866,-1.063049
g,-0.125381,-0.945588,2.029544,-1.046358,-1.306482,-1.632924,0.802129,-1.667537
h,0.608857,0.286473,-0.205792,2.493990,-0.547260,0.496727,-1.235614,-0.798428

In [215]:
df['w']

          w         w
a  0.197524  0.305632
b -0.251897  0.327845
c -0.383258 -0.982776
d  1.133703 -1.398290
e  0.093628 -0.380104
f  0.178009  1.130018
g -0.125381 -1.306482
h  0.608857 -0.547260

In [216]:
df.z

          z         z
a -0.863091 -1.560931
b  0.200780  0.780140
c  0.196275 -1.522333
d -0.630507  0.012421
e -1.908009  1.522562
f  1.743477 -1.063049
g -1.046358 -1.667537
h  2.493990 -0.798428

In [217]:
df

,w,x,y,z,w,x,y,z
a,0.197524,2.302987,0.729024,-0.863091,0.305632,0.243178,0.864165,-1.560931
b,-0.251897,-0.578120,0.236996,0.200780,0.327845,0.674485,-0.174057,0.780140
c,-0.383258,-0.409318,0.343539,0.196275,-0.982776,2.231555,-0.971393,-1.522333
d,1.133703,0.528187,0.393461,-0.630507,-1.398290,-0.219311,-0.045676,0.012421
e,0.093628,1.240813,-1.097693,-1.908009,-0.380104,-1.666059,-2.736995,1.522562
f,0.178009,-0.626805,-0.391089,1.743477,1.130018,0.897796,0.330866,-1.063049
g,-0.125381,-0.945588,2.029544,-1.046358,-1.306482,-1.632924,0.802129,-1.667537
h,0.608857,0.286473,-0.205792,2.493990,-0.547260,0.496727,-1.235614,-0.798428

In [218]:
df.iloc[2]

w   -0.383258
x   -0.409318
y    0.343539
z    0.196275
w   -0.982776
x    2.231555
y   -0.971393
z   -1.522333
Name: c, dtype: float64

In [219]:
np.random.randn(1,900000)

array([[ 0.75412143, -0.77204064, -0.03443164, ..., -0.77403933,
        -0.19679737, -0.62344293]])

In [220]:
df.std()

w    0.492555
x    1.107689
y    0.915000
z    1.474159
w    0.889096
x    1.304143
y    1.209494
z    1.190499
dtype: float64

CSV

CSV INPUT

CSV stands for [comma separated values]

In [223]:
df = pd.read_csv('example')

FileNotFoundError: [Errno 2] No such file or directory: 'example'

In [224]:
df

,w,x,y,z,w,x,y,z
a,0.197524,2.302987,0.729024,-0.863091,0.305632,0.243178,0.864165,-1.560931
b,-0.251897,-0.578120,0.236996,0.200780,0.327845,0.674485,-0.174057,0.780140
c,-0.383258,-0.409318,0.343539,0.196275,-0.982776,2.231555,-0.971393,-1.522333
d,1.133703,0.528187,0.393461,-0.630507,-1.398290,-0.219311,-0.045676,0.012421
e,0.093628,1.240813,-1.097693,-1.908009,-0.380104,-1.666059,-2.736995,1.522562
f,0.178009,-0.626805,-0.391089,1.743477,1.130018,0.897796,0.330866,-1.063049
g,-0.125381,-0.945588,2.029544,-1.046358,-1.306482,-1.632924,0.802129,-1.667537
h,0.608857,0.286473,-0.205792,2.493990,-0.547260,0.496727,-1.235614,-0.798428

 CSV

 CSV INPUT

CSV stands for comma separated values

In [227]:
df = pd.read_csv('example')  #reads the example .csv file from the same directory

FileNotFoundError: [Errno 2] No such file or directory: 'example'